packages/eopayment/eopayment-3.7.tar.gz/eopayment-3.7/tests/data/payfip-test_get_idop_adresse_mel_incorrect.json

[["<soap-env:Envelope xmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:creerPaiementSecurise xmlns:ns0=\"http://securite.service.tpa.cp.finances.gouv.fr/services/mas_securite/contrat_paiement_securise/PaiementSecuriseService\">\n      <arg0>\n        <exer>2019</exer>\n        <mel>john.doeexample.com</mel>\n        <montant>9990000001</montant>\n        <numcli>090909</numcli>\n        <objet>coucou</objet>\n        <refdet>ABCDEF</refdet>\n        <saisie>T</saisie>\n        <urlnotif>https://notif.payfip.example.com/</urlnotif>\n        <urlredirect>https://redirect.payfip.example.com/</urlredirect>\n      </arg0>\n    </ns0:creerPaiementSecurise>\n  </soap-env:Body>\n</soap-env:Envelope>\n", "<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <S:Fault xmlns:ns4=\"http://www.w3.org/2003/05/soap-envelope\">\n      <faultcode>S:Server</faultcode>\n      <faultstring>fr.gouv.finances.cp.tpa.webservice.exceptions.FonctionnelleErreur</faultstring>\n      <detail>\n        <ns2:FonctionnelleErreur xmlns:ns2=\"http://securite.service.tpa.cp.finances.gouv.fr/services/mas_securite/contrat_paiement_securise/PaiementSecuriseService\">\n          <code>A2</code>\n          <descriptif/>\n          <libelle>Adresse m&#233;l incorrecte. </libelle>\n          <severite>2</severite>\n        </ns2:FonctionnelleErreur>\n      </detail>\n    </S:Fault>\n  </S:Body>\n</S:Envelope>\n"]]