packages/eopayment/eopayment-3.7.tar.gz/eopayment-3.7/tests/data/payfip-test_get_client_info.json

[["<soap-env:Envelope xmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:recupererDetailClient xmlns:ns0=\"http://securite.service.tpa.cp.finances.gouv.fr/services/mas_securite/contrat_paiement_securise/PaiementSecuriseService\">\n      <arg0>\n        <numCli>090909</numCli>\n      </arg0>\n    </ns0:recupererDetailClient>\n  </soap-env:Body>\n</soap-env:Envelope>\n", "<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <ns2:recupererDetailClientResponse xmlns:ns2=\"http://securite.service.tpa.cp.finances.gouv.fr/services/mas_securite/contrat_paiement_securise/PaiementSecuriseService\">\n      <return>\n        <libelleN1>RR COMPOSTEURS INDIVIDUELS</libelleN1>\n        <libelleN2>POUETPOUET</libelleN2>\n        <libelleN3>COLLECTE VALORISATION DECHETS</libelleN3>\n        <numcli>090909</numcli>\n      </return>\n    </ns2:recupererDetailClientResponse>\n  </S:Body>\n</S:Envelope>\n"]]