packages/eopayment/eopayment-3.7.tar.gz/eopayment-3.7/tests/data/payfip-test_get_info_paiement_P5.json

[["<soap-env:Envelope xmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:recupererDetailPaiementSecurise xmlns:ns0=\"http://securite.service.tpa.cp.finances.gouv.fr/services/mas_securite/contrat_paiement_securise/PaiementSecuriseService\">\n      <arg0>\n        <idOp>cc0cb210-1cd4-11ea-8cca-0213ad91a103</idOp>\n      </arg0>\n    </ns0:recupererDetailPaiementSecurise>\n  </soap-env:Body>\n</soap-env:Envelope>\n", "<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <S:Fault xmlns:ns4=\"http://www.w3.org/2003/05/soap-envelope\">\n      <faultcode>S:Server</faultcode>\n      <faultstring>fr.gouv.finances.cp.tpa.webservice.exceptions.FonctionnelleErreur</faultstring>\n      <detail>\n        <ns2:FonctionnelleErreur xmlns:ns2=\"http://securite.service.tpa.cp.finances.gouv.fr/services/mas_securite/contrat_paiement_securise/PaiementSecuriseService\">\n          <code>P5</code><descriptif />\n                    <libelle>R&#233;sultat de la transaction non connu.</libelle><severite>2</severite>\n        </ns2:FonctionnelleErreur>\n      </detail>\n    </S:Fault>\n  </S:Body>\n</S:Envelope>\n"]]
